## Plan for scan_queue
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 6 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.scan_runner_policies will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "scan_runner_policies"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:lambda:ca-central-1:806545929748:function:api",
            ]
        }
      + statement {
          + actions   = [
              + "states:CreateActivity",
              + "states:CreateStateMachine",
              + "states:DescribeExecution",
              + "states:ListActivities",
              + "states:ListStateMachines",
              + "states:StartExecution",
              + "states:StopExecution",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:states:ca-central-1:806545929748:*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetRecords",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "states:CreateActivity",
              + "states:CreateStateMachine",
              + "states:DescribeExecution",
              + "states:ListActivities",
              + "states:ListStateMachines",
              + "states:StartExecution",
              + "states:StopExecution",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:states:ca-central-1:806545929748:*",
            ]
        }
      + statement {
          + actions   = [
              + "events:DescribeRule",
              + "events:PutRule",
              + "events:PutTargets",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:events:ca-central-1:806545929748:*",
            ]
        }
    }

  # data.template_file.scan_queue will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "scan_queue"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            {
              + StartAt = "Get Lock"
              + States  = {
                  + Check If Results Available = {
                      + Choices   = [
                          + {
                              + BooleanEquals = true
                              + Next          = "Release Lock"
                              + Variable      = "$.payload"
                            },
                        ]
                      + Default   = "Wait to Get Results"
                      + InputPath = "$.[0]"
                      + Type      = "Choice"
                    }
                  + Get AssemblyLine Result    = {
                      + Branches = [
                          + {
                              + StartAt = "Get Assemblyline Result"
                              + States  = {
                                  + Get Assemblyline Result = {
                                      + End            = true
                                      + Parameters     = {
                                          + FunctionName = "${worker_lambda}"
                                          + Payload      = {
                                              + Input.$        = "$.[0].payload"
                                              + execution_id.$ = "$$.Execution.Id"
                                              + task           = "assemblyline_result"
                                            }
                                        }
                                      + Resource       = "arn:aws:states:::lambda:invoke"
                                      + ResultSelector = {
                                          + payload.$ = "$.Payload"
                                        }
                                      + Type           = "Task"
                                    }
                                }
                            },
                        ]
                      + Next     = "Check If Results Available"
                      + Type     = "Parallel"
                    }
                  + Get Lock                   = {
                      + Branches   = [
                          + {
                              + StartAt = "Acquire Lock"
                              + States  = {
                                  + Acquire Lock                               = {
                                      + Catch      = [
                                          + {
                                              + ErrorEquals = [
                                                  + "DynamoDB.AmazonDynamoDBException",
                                                ]
                                              + Next        = "Initialize Lock Item"
                                              + ResultPath  = "$.lockinfo.acquisitionerror"
                                            },
                                          + {
                                              + ErrorEquals = [
                                                  + "DynamoDB.ConditionalCheckFailedException",
                                                ]
                                              + Next        = "Get Current Lock Record"
                                              + ResultPath  = "$.lockinfo.acquisitionerror"
                                            },
                                        ]
                                      + End        = true
                                      + Parameters = {
                                          + ConditionExpression       = "currentlockcount <> :limit and attribute_not_exists(#lockownerid)"
                                          + ExpressionAttributeNames  = {
                                              + #currentlockcount = "currentlockcount"
                                              + #lockownerid.$    = "$$.Execution.Id"
                                            }
                                          + ExpressionAttributeValues = {
                                              + :increase         = {
                                                  + N = "1"
                                                }
                                              + :limit            = {
                                                  + N = "${concurrent_scan_limit}"
                                                }
                                              + :lockacquiredtime = {
                                                  + S.$ = "$$.State.EnteredTime"
                                                }
                                            }
                                          + Key                       = {
                                              + LockName = {
                                                  + S = "${lock_name}"
                                                }
                                            }
                                          + ReturnValues              = "UPDATED_NEW"
                                          + TableName                 = "${table_semaphore}"
                                          + UpdateExpression          = "SET #currentlockcount = #currentlockcount + :increase, #lockownerid = :lockacquiredtime"
                                        }
                                      + Resource   = "arn:aws:states:::dynamodb:updateItem"
                                      + Retry      = [
                                          + {
                                              + ErrorEquals = [
                                                  + "DynamoDB.AmazonDynamoDBException",
                                                ]
                                              + MaxAttempts = 0
                                            },
                                          + {
                                              + BackoffRate = 2
                                              + ErrorEquals = [
                                                  + "States.ALL",
                                                ]
                                              + MaxAttempts = 6
                                            },
                                        ]
                                      + Type       = "Task"
                                    }
                                  + Check If Lock Already Acquired             = {
                                      + Choices = [
                                          + {
                                              + And  = [
                                                  + {
                                                      + IsPresent = true
                                                      + Variable  = "$.lockinfo.currentlockitem.ItemString"
                                                    },
                                                  + {
                                                      + StringMatches = "*Z*"
                                                      + Variable      = "$.lockinfo.currentlockitem.ItemString"
                                                    },
                                                ]
                                              + Next = "Continue Because Lock Was Already Acquired"
                                            },
                                        ]
                                      + Default = "Wait to Get Lock"
                                      + Type    = "Choice"
                                    }
                                  + Continue Because Lock Was Already Acquired = {
                                      + End  = true
                                      + Type = "Pass"
                                    }
                                  + Get Current Lock Record                    = {
                                      + Next           = "Check If Lock Already Acquired"
                                      + Parameters     = {
                                          + ExpressionAttributeNames = {
                                              + #lockownerid.$ = "$$.Execution.Id"
                                            }
                                          + Key                      = {
                                              + LockName = {
                                                  + S = "${lock_name}"
                                                }
                                            }
                                          + ProjectionExpression     = "#lockownerid"
                                          + TableName                = "${table_semaphore}"
                                        }
                                      + Resource       = "arn:aws:states:::dynamodb:getItem"
                                      + ResultPath     = "$.lockinfo.currentlockitem"
                                      + ResultSelector = {
                                          + Item.$       = "$.Item"
                                          + ItemString.$ = "States.JsonToString($.Item)"
                                        }
                                      + Type           = "Task"
                                    }
                                  + Initialize Lock Item                       = {
                                      + Catch      = [
                                          + {
                                              + ErrorEquals = [
                                                  + "States.ALL",
                                                ]
                                              + Next        = "Acquire Lock"
                                              + ResultPath  = null
                                            },
                                        ]
                                      + Next       = "Acquire Lock"
                                      + Parameters = {
                                          + ConditionExpression       = "LockName <> :lockname"
                                          + ExpressionAttributeValues = {
                                              + :lockname = {
                                                  + S = "${lock_name}"
                                                }
                                            }
                                          + Item                      = {
                                              + LockName         = {
                                                  + S = "${lock_name}"
                                                }
                                              + currentlockcount = {
                                                  + N = "0"
                                                }
                                            }
                                          + TableName                 = "${table_semaphore}"
                                        }
                                      + Resource   = "arn:aws:states:::dynamodb:putItem"
                                      + ResultPath = null
                                      + Type       = "Task"
                                    }
                                  + Wait to Get Lock                           = {
                                      + Next    = "Acquire Lock"
                                      + Seconds = 3
                                      + Type    = "Wait"
                                    }
                                }
                            },
                        ]
                      + Next       = "Submit to AssemblyLine"
                      + ResultPath = null
                      + Type       = "Parallel"
                    }
                  + Release Lock               = {
                      + Catch      = [
                          + {
                              + ErrorEquals = [
                                  + "DynamoDB.ConditionalCheckFailedException",
                                ]
                              + Next        = "Success State"
                              + ResultPath  = null
                            },
                        ]
                      + Next       = "Success State"
                      + Parameters = {
                          + ConditionExpression       = "attribute_exists(#lockownerid)"
                          + ExpressionAttributeNames  = {
                              + #currentlockcount = "currentlockcount"
                              + #lockownerid.$    = "$$.Execution.Id"
                            }
                          + ExpressionAttributeValues = {
                              + :decrease = {
                                  + N = "1"
                                }
                            }
                          + Key                       = {
                              + LockName = {
                                  + S = "${lock_name}"
                                }
                            }
                          + ReturnValues              = "UPDATED_NEW"
                          + TableName                 = "${table_semaphore}"
                          + UpdateExpression          = "SET #currentlockcount = #currentlockcount - :decrease REMOVE #lockownerid"
                        }
                      + Resource   = "arn:aws:states:::dynamodb:updateItem"
                      + ResultPath = null
                      + Retry      = [
                          + {
                              + ErrorEquals = [
                                  + "DynamoDB.ConditionalCheckFailedException",
                                ]
                              + MaxAttempts = 0
                            },
                          + {
                              + BackoffRate = 1.5
                              + ErrorEquals = [
                                  + "States.ALL",
                                ]
                              + MaxAttempts = 5
                            },
                        ]
                      + Type       = "Task"
                    }
                  + Submit to AssemblyLine     = {
                      + Branches = [
                          + {
                              + StartAt = "Start AssemblyLine scan"
                              + States  = {
                                  + Start AssemblyLine scan = {
                                      + End            = true
                                      + Parameters     = {
                                          + FunctionName = "${worker_lambda}"
                                          + Payload      = {
                                              + Input.$        = "$"
                                              + execution_id.$ = "$$.Execution.Id"
                                              + task           = "assemblyline_scan"
                                            }
                                        }
                                      + Resource       = "arn:aws:states:::lambda:invoke"
                                      + ResultSelector = {
                                          + payload.$ = "$.Payload"
                                        }
                                      + Type           = "Task"
                                    }
                                }
                            },
                        ]
                      + Next     = "Get AssemblyLine Result"
                      + Type     = "Parallel"
                    }
                  + Success State              = {
                      + Type = "Succeed"
                    }
                  + Wait to Get Results        = {
                      + Next    = "Get AssemblyLine Result"
                      + Seconds = 30
                      + Type    = "Wait"
                    }
                }
            }
        )
      + vars     = {
          + "concurrent_scan_limit" = "10"
          + "lock_name"             = "ScanSemaphore"
          + "table_semaphore"       = "scan-locktable"
          + "worker_lambda"         = "api"
        }
    }

  # aws_dynamodb_table.completed-scans will be created
  + resource "aws_dynamodb_table" "completed-scans" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "EXECUTION_ID"
      + id               = (known after apply)
      + name             = "completed-scans"
      + read_capacity    = 0
      + stream_arn       = (known after apply)
      + stream_enabled   = false
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + write_capacity   = 0

      + attribute {
          + name = "EXECUTION_ID"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = false
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = (known after apply)
        }
    }

  # aws_dynamodb_table.scan-locktable will be created
  + resource "aws_dynamodb_table" "scan-locktable" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "LockName"
      + id               = (known after apply)
      + name             = "scan-locktable"
      + read_capacity    = 0
      + stream_arn       = (known after apply)
      + stream_enabled   = false
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + write_capacity   = 0

      + attribute {
          + name = "LockName"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = false
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = (known after apply)
        }
    }

  # aws_iam_policy.scan_queue will be created
  + resource "aws_iam_policy" "scan_queue" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "scan-files-scan_queue"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags      = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + tags_all  = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_role.scan_queue will be created
  + resource "aws_iam_role" "scan_queue" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "lambda.amazonaws.com",
                              + "states.ca-central-1.amazonaws.com",
                            ]
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "scan-files-scan_queue"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.scan_runner will be created
  + resource "aws_iam_role_policy_attachment" "scan_runner" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "scan-files-scan_queue"
    }

  # aws_sfn_state_machine.scan_queue will be created
  + resource "aws_sfn_state_machine" "scan_queue" {
      + arn           = (known after apply)
      + creation_date = (known after apply)
      + definition    = (known after apply)
      + id            = (known after apply)
      + name          = "assemblyline-file-scan-queue"
      + role_arn      = (known after apply)
      + status        = (known after apply)
      + tags          = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + tags_all      = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + type          = "STANDARD"

      + logging_configuration {
          + include_execution_data = (known after apply)
          + level                  = (known after apply)
          + log_destination        = (known after apply)
        }

      + tracing_configuration {
          + enabled = (known after apply)
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

9 tests, 9 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
